package org.cellang.viewsframework.format;

public class BalanceSheetContent {
	static String content = "\n"//
			+ ",资产总计                       \n"//
			+ ",,流动资产合计                  \n"//
			+ ",,,货币资金                     \n"//
			+ ",,,结算备付金                   \n"//
			+ ",,,拆出资金                     \n"//
			+ ",,,交易性金融资产               \n"//
			+ ",,,衍生金融资产                 \n"//
			+ ",,,应收票据                     \n"//
			+ ",,,应收账款                     \n"//
			+ ",,,预付款项                     \n"//
			+ ",,,应收保费                     \n"//
			+ ",,,应收分保账款                 \n"//
			+ ",,,应收分保合同准备金           \n"//
			+ ",,,应收利息                     \n"//
			+ ",,,应收股利                     \n"//
			+ ",,,其他应收款                   \n"//
			+ ",,,应收出口退税                 \n"//
			+ ",,,应收补贴款                   \n"//
			+ ",,,应收保证金                   \n"//
			+ ",,,内部应收款                   \n"//
			+ ",,,买入返售金融资产             \n"//
			+ ",,,存货                         \n"//
			+ ",,,待摊费用                     \n"//
			+ ",,,待处理流动资产损益           \n"//
			+ ",,,一年内到期的非流动资产       \n"//
			+ ",,,其他流动资产                 \n"//
			+ ",,非流动资产合计                \n"//
			+ ",,,发放贷款及垫款               \n"//
			+ ",,,可供出售金融资产             \n"//
			+ ",,,持有至到期投资               \n"//
			+ ",,,长期应收款                   \n"//
			+ ",,,长期股权投资                 \n"//
			+ ",,,其他长期投资                 \n"//
			+ ",,,投资性房地产                 \n"//
			+ ",,,固定资产原值                 \n"//
			+ ",,,累计折旧                     \n"//
			+ ",,,固定资产净值                 \n"//
			+ ",,,固定资产减值准备             \n"//
			+ ",,,固定资产                     \n"//
			+ ",,,在建工程                     \n"//
			+ ",,,工程物资                     \n"//
			+ ",,,固定资产清理                 \n"//
			+ ",,,生产性生物资产               \n"//
			+ ",,,公益性生物资产               \n"//
			+ ",,,油气资产                     \n"//
			+ ",,,无形资产                     \n"//
			+ ",,,开发支出                     \n"//
			+ ",,,商誉                         \n"//
			+ ",,,长期待摊费用                 \n"//
			+ ",,,股权分置流通权               \n"//
			+ ",,,递延所得税资产               \n"//
			+ ",,,其他非流动资产               \n"//
			+ ",负债合计                       \n"//
			+ ",,流动负债合计                  \n"//
			+ ",,,短期借款                     \n"//
			+ ",,,向中央银行借款               \n"//
			+ ",,,吸收存款及同业存放           \n"//
			+ ",,,拆入资金                     \n"//
			+ ",,,交易性金融负债               \n"//
			+ ",,,衍生金融负债                 \n"//
			+ ",,,应付票据                     \n"//
			+ ",,,应付账款                     \n"//
			+ ",,,预收账款                     \n"//
			+ ",,,卖出回购金融资产款           \n"//
			+ ",,,应付手续费及佣金             \n"//
			+ ",,,应付职工薪酬                 \n"//
			+ ",,,应交税费                     \n"//
			+ ",,,应付利息                     \n"//
			+ ",,,应付股利                     \n"//
			+ ",,,其他应交款                   \n"//
			+ ",,,应付保证金                   \n"//
			+ ",,,内部应付款                   \n"//
			+ ",,,其他应付款                   \n"//
			+ ",,,预提费用                     \n"//
			+ ",,,预计流动负债                 \n"//
			+ ",,,应付分保账款                 \n"//
			+ ",,,保险合同准备金               \n"//
			+ ",,,代理买卖证券款               \n"//
			+ ",,,代理承销证券款               \n"//
			+ ",,,国际票证结算                 \n"//
			+ ",,,国内票证结算                 \n"//
			+ ",,,递延收益                     \n"//
			+ ",,,应付短期债券                 \n"//
			+ ",,,一年内到期的非流动负债       \n"//
			+ ",,,其他流动负债                 \n"//
			+ ",,非流动负债合计                \n"//
			+ ",,,长期借款                     \n"//
			+ ",,,应付债券                     \n"//
			+ ",,,长期应付款                   \n"//
			+ ",,,专项应付款                   \n"//
			+ ",,,预计非流动负债               \n"//
			+ ",,,长期递延收益                 \n"//
			+ ",,,递延所得税负债               \n"//
			+ ",,,其他非流动负债               \n"//
			+ ",所有者权益合计                 \n"//
			+ ",,实收资本              \n"//
			+ ",,资本公积                      \n"//
			+ ",,减:库存股                     \n"//
			+ ",,专项储备                      \n"//
			+ ",,盈余公积                      \n"//
			+ ",,一般风险准备                  \n"//
			+ ",,未确定的投资损失              \n"//
			+ ",,未分配利润                    \n"//
			+ ",,拟分配现金股利                \n"//
			+ ",,外币报表折算差额              \n"//
			+ ",,归属于母公司股东权益合计      \n"//
			+ ",,少数股东权益\n"//

	;

	static String incomeStatement = ""//
			+ ",营业总收入,                            \n"//
			+ ",,营业收入,                              \n"//
			+ ",,利息收入,                              \n"//
			+ ",,已赚保费,                              \n"//
			+ ",,手续费及佣金收入,                       \n"//
			+ ",,房地产销售收入,                         \n"//
			+ ",,其他业务收入,                          \n"//
			+ ",营业总成本,                            \n"//
			+ ",,营业成本,                              \n"//
			+ ",,利息支出,                              \n"//
			+ ",,手续费及佣金支出,                       \n"//
			+ ",,房地产销售成本,                         \n"//
			+ ",,研发费用,                              \n"//
			+ ",,退保金,                               \n"//
			+ ",,赔付支出净额,                          \n"//
			+ ",,提取保险合同准备金净额,                  \n"//
			+ ",,保单红利支出,                          \n"//
			+ ",,分保费用,                              \n"//
			+ ",,其他业务成本,                          \n"//
			+ ",,营业税金及附加,                         \n"//
			+ ",,销售费用,                              \n"//
			+ ",,管理费用,                              \n"//
			+ ",,财务费用,                              \n"//
			+ ",,资产减值损失,                          \n"//
			+ ",,公允价值变动收益,                       \n"//
			+ ",,投资收益,                              \n"//
			+ ",,对联营企业和合营企业的投资收益,           \n"//
			+ ",,汇兑收益,                              \n"//
			+ ",,期货损益,                              \n"//
			+ ",,托管收益,                              \n"//
			+ ",,补贴收入,                              \n"//
			+ ",,其他业务利润,                          \n"//
			+ ",营业利润,                              \n"//
			+ ",,营业外收入,                            \n"//
			+ ",,营业外支出,                            \n"//
			+ ",,非流动资产处置损失,                     \n"//
			+ ",,利润总额,                              \n"//
			+ ",,所得税费用,                            \n"//
			+ ",,未确认投资损失,                         \n"//
			+ ",净利润,                               \n"//
			+ ",,归属于母公司所有者的净利润,              \n"//
			+ ",,被合并方在合并前实现净利润,              \n"//
			+ ",,少数股东损益,                          \n"//
			+ ",每股权益,                              \n"//
			+ ",,基本每股收益,                          \n"//
			+ ",,稀释每股收益,                          \n"//
	//
	;

	static String cashFlowStatement = ""//
			//
			+",经营活动产生的现金流量净额\n"//
			+",,经营活动现金流入小计\n"//
			+",,,销售商品、提供劳务收到的现金\n"//
			+",,,客户存款和同业存放款项净增加额\n"//
			+",,,向中央银行借款净增加额\n"//
			+",,,向其他金融机构拆入资金净增加额\n"//
			+",,,收到原保险合同保费取得的现金\n"//
			+",,,收到再保险业务现金净额\n"//
			+",,,保户储金及投资款净增加额\n"//
			+",,,处置交易性金融资产净增加额\n"//
			+",,,收取利息、手续费及佣金的现金\n"//
			+",,,拆入资金净增加额\n"//
			+",,,回购业务资金净增加额\n"//
			+",,,收到的税费返还\n"//
			+",,,收到的其他与经营活动有关的现金\n"//			
			+",,经营活动现金流出小计\n"//
			+",,,购买商品、接受劳务支付的现金\n"//
			+",,,客户贷款及垫款净增加额\n"//
			+",,,存放中央银行和同业款项净增加额\n"//
			+",,,支付原保险合同赔付款项的现金\n"//
			+",,,支付利息、手续费及佣金的现金\n"//
			+",,,支付保单红利的现金\n"//
			+",,,支付给职工以及为职工支付的现金\n"//
			+",,,支付的各项税费\n"//
			+",,,支付的其他与经营活动有关的现金\n"//
			//
			+",投资活动产生的现金流量净额\n"//
			+",,投资活动现金流入小计\n"//
			+",,,收回投资所收到的现金\n"//
			+",,,取得投资收益所收到的现金\n"//
			+",,,处置固定资产、无形资产和其他长期资产所收回的现金净额\n"//
			+",,,处置子公司及其他营业单位收到的现金净额\n"//
			+",,,收到的其他与投资活动有关的现金\n"//
			+",,,减少质押和定期存款所收到的现金\n"//
			+",,投资活动现金流出小计\n"//
			+",,,购建固定资产、无形资产和其他长期资产所支付的现金\n"//
			+",,,投资所支付的现金\n"//
			+",,,质押贷款净增加额\n"//
			+",,,取得子公司及其他营业单位支付的现金净额\n"//
			+",,,支付的其他与投资活动有关的现金\n"//
			+",,,增加质押和定期存款所支付的现金\n"//
			//
			+",筹资活动产生的现金流量净额\n"//
			+",,筹资活动现金流入小计\n"//
			+",,,吸收投资收到的现金\n"//
			+",,,其中：子公司吸收少数股东投资收到的现金\n"//
			+",,,取得借款收到的现金\n"//
			+",,,发行债券收到的现金\n"//
			+",,,收到其他与筹资活动有关的现金\n"//
			+",,筹资活动现金流出小计\n"//
			+",,,偿还债务支付的现金\n"//
			+",,,分配股利、利润或偿付利息所支付的现金\n"//
			+",,,其中：子公司支付给少数股东的股利、利润\n"//
			+",,,支付其他与筹资活动有关的现金\n"//
			//
			+",汇率变动对现金及现金等价物的影响\n"//			
			+",现金及现金等价物净增加额\n"//
			+",,加:期初现金及现金等价物余额\n"//
			+",,期末现金及现金等价物余额\n"//
			;//
	static String cashFlowStatement2 = ""//
			+",补充资料\n"//
			+",,1、将净利润调节为经营活动的现金流量\n"//
			+",,,净利润\n"//
			+",,,少数股东损益\n"//
			+",,,未确认的投资损失\n"//
			+",,,资产减值准备\n"//
			+",,,固定资产折旧、油气资产折耗、生产性物资折旧\n"//
			+",,,无形资产摊销\n"//
			+",,,长期待摊费用摊销\n"//
			+",,,待摊费用的减少\n"//
			+",,,预提费用的增加\n"//
			+",,,处置固定资产、无形资产和其他长期资产的损失\n"//
			+",,,固定资产报废损失\n"//
			+",,,公允价值变动损失\n"//
			+",,,递延收益增加(减：减少)\n"//
			+",,,预计负债\n"//
			+",,,财务费用\n"//
			+",,,投资损失\n"//
			+",,,递延所得税资产减少\n"//
			+",,,递延所得税负债增加\n"//
			+",,,存货的减少\n"//
			+",,,经营性应收项目的减少\n"//
			+",,,经营性应付项目的增加\n"//
			+",,,已完工尚未结算款的减少(减:增加)\n"//
			+",,,已结算尚未完工款的增加(减:减少)\n"//
			+",,,其他\n"//
			+",,,经营活动产生现金流量净额\n"//
			+",,2、不涉及现金收支的重大投资和筹资活动\n"//
			+",,,债务转为资本\n"//
			+",,,一年内到期的可转换公司债券\n"//
			+",,,融资租入固定资产\n"//
			+",,3、现金及现金等价物净变动\n"//
			+",,,现金的期末余额\n"//
			+",,,现金的期初余额\n"//
			+",,,现金等价物的期末余额\n"//
			+",,,现金等价物的期初余额\n"//
			+",,,现金及现金等价物的净增加额\n"//
	//
	;
}
